<template>
  <section>
    <div class="account__tabs-content active">
      <div class="account__save-tabs">
        <ul class="account__save-tabs-caption">
          <li v-for="tab in tabs" :key="tab.id" :class="tab.active" @click="activeTab(tab.id)">
            {{ tab.title }}
          </li>
        </ul>
        <div :class="'account__save-tabs-content '+this.tabs[0].active">
          <div class="guide-list__wrapper">
            <div class="guide-list__items" v-if="places.length>0">
              <div class="guide-list__item" v-for="(item,i) in this.places" :key="i">
                <div class="guide-list__item-img" :style="'background-image: url('+getImages(item.image)+');'">
                  <NuxtLink :to="'/places/'+item.alias"></NuxtLink>
                </div>
                <div class="guide-list__item-info">
                  <div class="guide-list__item-category" v-for="(item,i) in item.category" :key="i">
                    {{item['title_'+$i18n.locale]}} /
                  </div>
                  <div class="guide-list__item-rating">
                    <div class="guide-list__item-rating-star active">
                      <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                    </div>
                    <div class="guide-list__item-rating-star active">
                      <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                    </div>
                    <div class="guide-list__item-rating-star active">
                      <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                    </div>
                    <div class="guide-list__item-rating-star active">
                      <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                    </div>
                    <div class="guide-list__item-rating-star">
                      <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                    </div>
                  </div>
                </div>
                <div class="guide-list__item-content">
                  <NuxtLink :to="'/places/'+item.alias" class="guide-list__item-title">
                    {{item['title_'+$i18n.locale]}}
                  </NuxtLink>
                  <p class="guide-list__item-text" v-html="truncate(item['description_'+$i18n.locale],100)"></p>
                  <div class="guide-list__item-about">
                    <NuxtLink :to="'/places/'+item.alias" class="guide-list__about-link">{{ $t('more_info') }}</NuxtLink>
                  </div>
                </div>
              </div>
            </div>
            <div class="account__not-found" v-else>
              <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
              <h4 class="account__not-found-text">
                <p>{{$t('cabinet_not_saving')}}.</p>
              </h4>
              <div class="load-more">
                <NuxtLink to="/places">{{ $t('load_routes') }}</NuxtLink>
              </div>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[1].active">
          <div class="calendar__inner__cabinet" v-if="events.length>0">
            <div class="calendar__item" v-for="(item,i) in events" :key="i">
              <div class="calendar__item-img" :style="'background-image: url('+getImages(item.image)+');'">
                <div class="calendar__item-day" v-if="item.workdays.length>0">
                  <div v-for="(day,index) in item.workdays" :key="index">
                    <span>{{ $t('date') }} </span>{{day.date_start}} - {{day.date_end}}
                  </div>

                </div>
                <div class="calendar__item-time">
                  <div v-for="(day,index) in item.workdays" :key="index">
                    <span>{{ $t('time') }} </span>{{day.time_start}} - {{day.time_end}}
                  </div>
                </div>
              </div>
              <div class="calendar__item-inner">
                <h4 class="calendar__item-title">
                  {{ item['title_'+$i18n.locale] }}
                </h4>
                <div class="calendar__item-location">
                  {{ item.address }}
                </div>
                <p class="calendar__item-text" v-html="truncate(item['description_'+$i18n.locale], 50)"></p>
                <div class="calendar__btn-wrapper">
                  <NuxtLink class="calendar__item-btn popup-modal" :to="'/events/' + item.alias">
                    <span>{{ $t('more_info') }}</span>
                  </NuxtLink>
                </div>
              </div>
            </div>
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/events">{{ $t('load_events') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[2].active">
          <div class="routes-page__list" v-if="routes.length>0">
            <NuxtLink class="routes-page__link" :to="'/routes/'+item.alias" v-for="(item,i) in routes" :key="i">
              <div class="routes-page__item">
                <div class="routes-page__item-img" :style="'background-image: url('+getImages(item.image)+');'"></div>
                <div class="routes-page__item-content">
                  <h4 class="routes-page__item-title">
                    {{ item['title_'+$i18n.locale] }}
                  </h4>
                  <!--                    <ul class="routes-page__item-categories item-categories">-->
                  <!--                      <li class="routes-page__item-category item-category">-->
                  <!--                        Природа-->
                  <!--                      </li>-->
                  <!--                      <li class="routes-page__item-category item-category">-->
                  <!--                        На велосипеде-->
                  <!--                      </li>-->
                  <!--                    </ul>-->
                  <div class="routes-page__item-text" v-html="truncate(item['description_'+$i18n.locale], 120)"></div>
                  <div class="routes-page__item-about">
                    <div class="routes-page__item-time">
                      {{ $t('duration') }}: <span>{{ item.time }}</span>
                    </div>
                    <div class="routes-page__item-distance">
                      {{ $t('distance') }}: <span>{{ item.distance }}</span>
                    </div>
                    <div class="routes-page__item-points" v-if="item.places.length>0">
                      {{ $t('count_of_points') }}: <span>{{item.places.length}}</span>
                    </div>
                    <div class="routes-page__item-points" v-else>
                      {{ $t('count_of_points') }}: <span>0</span>
                    </div>
                  </div>
                </div>
              </div>
            </NuxtLink>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/routes">{{ $t('load_routes') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[3].active">
          <div class="account__not-found">
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/blogs">{{ $t('load_news') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[4].active">
          <div class="routes-page__employees-list-wrapper" v-if="guides.length>0">
            <div class="routes-page__employees-list">
              <NuxtLink :to="'/guides/'+guide.alias" class="routes-page__employees-list-item" v-for="guide in guides" :key="guide.id">
                <div class="routes-page__employees-img" :style="'background-image: url('+getImages(guide.user.image)+');'"></div>
                <div class="routes-page__employees-content">
                  <h5 class="routes-page__employees-title">
                    {{ guide.user.name }}
                  </h5>
                  <div class="guide-item__rating-inner">
                    <div class="guide-list__item-rating">
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                    </div>
                    <div class="guide-item__contact-count">
                      (4)
                    </div>
                  </div>
                  <div class="routes-page__employees-lang">
                    <div class="routes-page__employees-lang-item">
                      {{ $t('languages') }}:
                    </div>
                    <div class="routes-page__employees-lang-item">
                      <span v-for="(lang,i) in guide.languages" :key="i">{{lang}} , </span>
                    </div>
                  </div>
                  <div class="routes-page__employees-info">
                    <div class="routes-page__employees-info-item">
                      {{ $t('excursions') }}: <span>5</span>
                    </div>
                    <div class="routes-page__employees-info-item">
                      {{ $t('reviews') }}: <span>20</span>
                    </div>
                  </div>
                </div>
              </NuxtLink>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/guides">{{ $t('load_guides') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[5].active">
          <div class="routes-page__tabs-content active" v-if="agencies.length>0">
            <div class="routes-page__travel-agency">
              <NuxtLink :to="'/agencies/'+agent.alias" class="routes-page__travel-agency-item" v-for="agent in agencies" :key="agent.id">
                <div class="routes-page__travel-agency-img" :style="'background-image: url('+getImages(agent.image)+');'"></div>
                <div class="routes-page__travel-agency-content">
                  <h5 class="routes-page__travel-agency-title">
                    {{ agent['title_'+$i18n.locale] }}
                  </h5>
                  <div class="guide-item__rating-inner">
                    <div class="guide-list__item-rating">
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star active">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                      <div class="guide-list__item-rating-star">
                        <svg height="511pt" viewBox="0 -10 511.98685 511" width="511pt" xmlns="http://www.w3.org/2000/svg"><path d="m510.652344 185.902344c-3.351563-10.367188-12.546875-17.730469-23.425782-18.710938l-147.773437-13.417968-58.433594-136.769532c-4.308593-10.023437-14.121093-16.511718-25.023437-16.511718s-20.714844 6.488281-25.023438 16.535156l-58.433594 136.746094-147.796874 13.417968c-10.859376 1.003906-20.03125 8.34375-23.402344 18.710938-3.371094 10.367187-.257813 21.738281 7.957031 28.90625l111.699219 97.960937-32.9375 145.089844c-2.410156 10.667969 1.730468 21.695313 10.582031 28.09375 4.757813 3.4375 10.324219 5.1875 15.9375 5.1875 4.839844 0 9.640625-1.304687 13.949219-3.882813l127.46875-76.183593 127.421875 76.183593c9.324219 5.609376 21.078125 5.097657 29.910156-1.304687 8.855469-6.417969 12.992187-17.449219 10.582031-28.09375l-32.9375-145.089844 111.699219-97.941406c8.214844-7.1875 11.351563-18.539063 7.980469-28.925781zm0 0"/></svg>
                      </div>
                    </div>
                    <div class="guide-item__contact-count">
                      (4)
                    </div>
                  </div>
                  <div class="routes-page__employees-info">
                    <div class="routes-page__employees-info-item" v-if="agent.routes.length>0">
                      {{ $t('routes_title') }}: <span>{{ agent.routes.length }}</span>
                    </div>
                    <div class="routes-page__employees-info-item" v-else>
                      {{ $t('routes_title') }}: <span>0</span>
                    </div>
                    <div class="routes-page__employees-info-item">
                      {{ $t('reviews') }}: <span>20</span>
                    </div>
                  </div>
                </div>
              </NuxtLink>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/agencies">{{ $t('load_agencies') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[6].active">
          <div class="souvenirs-page__tabs-content active" v-if="shops.length>0">
            <div class="souvenirs-page__craft-inner__cabinet">
              <NuxtLink :to="'/craft/'+item.alias" class="souvenirs-page__craft-item" v-for="(item,i) in shops" :key="i">
                <div class="souvenirs-page__craft-img" :style="'background-image: url('+getImages(item.image)+');'"></div>
                <div class="souvenirs-page__craft-content">
                  <h5 class="souvenirs-page__craft-name">
                    {{ item['title_'+$i18n.locale] }}
                  </h5>
                  <div class="souvenirs-page__craft-loc">
                    {{ item.address }}
                  </div>
                  <div class="souvenirs-page__craft-count" v-if="item.souvenirs.length>0">
                    {{ $t('products') }}: <span>{{item.souvenirs.length}}</span>
                  </div>
                  <div class="souvenirs-page__craft-count" v-else>
                    {{ $t('products') }}: <span>0</span>
                  </div>
                </div>
              </NuxtLink>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/craft">{{ $t('load_craft') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[7].active">
          <div class="souvenirs-page__tabs-content active" v-if="crafts.length>0">
            <div class="souvenirs-page__craft-inner">
              <NuxtLink :to="'/craftman/'+item.alias" class="souvenirs-page__craft-item" v-for="(item,i) in crafts" :key="i">
                <div class="souvenirs-page__craft-img" :style="'background-image: url('+getImages(item.image)+');'"></div>
                <div class="souvenirs-page__craft-content">
                  <h5 class="souvenirs-page__craft-name">
                    {{ item['title_'+$i18n.locale] }}
                  </h5>
                  <div class="souvenirs-page__craft-count" v-if="item.souvenirs.length>0">
                    {{ $t('products') }}: <span>{{item.souvenirs.length}}</span>
                  </div>
                  <div class="souvenirs-page__craft-count" v-else>
                    {{ $t('products') }}: <span>0</span>
                  </div>
                </div>
              </NuxtLink>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/craftman">{{ $t('load_craftman') }}</NuxtLink>
            </div>
          </div>
        </div>
        <div :class="'account__save-tabs-content '+this.tabs[8].active">
          <div class="souvenirs-page__items-wrapper" v-if="souvenirs.length>0">
            <div class="souvenirs__items-inner__cabinet">
              <div class="souvenirs__item" v-for="(item,i) in souvenirs" :key="i">
                <NuxtLink :to="'/souvenirs/'+item.alias">
                  <div class="souvenirs__item-img" :style="'background-image: url('+getImages(item.image)+');'"></div>
                </NuxtLink>
                <div class="souvenirs__item-content">
                  <h4 class="souvenirs__item-title">
                    <NuxtLink :to="'/souvenirs/'+item.alias">{{ item['title_'+$i18n.locale] }}</NuxtLink>
                  </h4>
                  <p class="souvenirs__item-text" v-html="truncate(item['description_'+$i18n.locale],50)"></p>
                  <div class="souvenirs__item-price-wrapper">
                    <button class="souvenirs__item-btn popup-modal" v-if="item.eventum">
                      <span>{{ $t('buy') }}</span>
                    </button>
                    <div class="souvenirs__item-price">
                      {{ item.price }} ТГ
                    </div>
                  </div>
                </div>
              </div>
            </div>
<!--            <div class="load-more">-->
<!--              <a href="#">Загрузить еще</a>-->
<!--            </div>-->
          </div>
          <div class="account__not-found" v-else>
            <svg xmlns="http://www.w3.org/2000/svg" width="50.922" height="42.435" viewBox="0 0 50.922 42.435"><g transform="translate(0 -2)"><path d="M45.618,44.435H5.3a5.31,5.31,0,0,1-5.3-5.3V24.278a1.062,1.062,0,0,1,.093-.435L8.515,5.13A5.318,5.318,0,0,1,13.352,2H37.57a5.318,5.318,0,0,1,4.838,3.13l8.421,18.714a1.062,1.062,0,0,1,.093.435V39.131a5.31,5.31,0,0,1-5.3,5.3Zm-43.5-19.93V39.131A3.187,3.187,0,0,0,5.3,42.313H45.618A3.187,3.187,0,0,0,48.8,39.131V24.505L40.472,6a3.192,3.192,0,0,0-2.9-1.876H13.352A3.191,3.191,0,0,0,10.45,6Z"/><path d="M35.38,22.609h-20.4A3.2,3.2,0,0,1,12,20.544L9.851,14.809a1.061,1.061,0,0,0-.993-.687H1.311a1.061,1.061,0,1,1,0-2.122H8.858a3.2,3.2,0,0,1,2.981,2.064L13.988,19.8a1.066,1.066,0,0,0,.993.687h20.4a1.061,1.061,0,0,0,.993-.687l2.149-5.735A3.2,3.2,0,0,1,41.5,12h8.077a1.061,1.061,0,0,1,0,2.122H41.5a1.061,1.061,0,0,0-.993.687l-2.149,5.735A3.2,3.2,0,0,1,35.38,22.609Z" transform="translate(0.28 11.217)"/></g></svg>
            <h4 class="account__not-found-text">
              <p>{{ $t('cabinet_not_saving') }}.</p>
            </h4>
            <div class="load-more">
              <NuxtLink to="/souvenirs">{{ $t('load_souvenirs') }}</NuxtLink>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: "index",
  layout: 'cabinet',
  data(){
    return {
      tabs: [
        {
          id: 0,
          title: 'Путеводитель',
          active: 'active'
        },
        {
          id: 1,
          title: 'Мероприятия',
          active: ''
        },
        {
          id: 2,
          title: 'Маршруты',
          active: ''
        },
        {
          id: 3,
          title: 'Блоги',
          active: ''
        },
        {
          id: 4,
          title: 'Гиды',
          active: ''
        },
        {
          id: 5,
          title: 'Тур.агенства',
          active: ''
        },
        {
          id: 6,
          title: 'Магазины',
          active: ''
        },
        {
          id: 7,
          title: 'Ремесленники',
          active: ''
        },
        {
          id: 8,
          title: 'Сувениры',
          active: ''
        }
      ]
    }
  },
  methods:{
    getImages(data){
      return this.$store.state.image.image + data ;
    },
    truncate(string, value) {
      return string.substring(0, value) + '...';
    },
    activeTab(i){
      this.tabs.forEach((item,i) => {
        item.active = ''
      })
      this.tabs[i].active = 'active'
    },
  },
  async asyncData({$axios}) {
    let places = [],
      events = [],
      routes = [],
      guides = [],
      agencies = [],
      shops = [],
      crafts = [],
      souvenirs = []
    try{
      await $axios.$get("/cabinet/savings").then((e)=>{
        // console.log(e.data)
        if (e.data.length>0){
          e.data.forEach((item,i) => {
            if (item.place){
              places.push(item.place)
            }
            if (item.event){
              events.push(item.event)
            }
            if (item.route){
              routes.push(item.route)
            }
            if (item.organizator){
              if (item.organizator.role_id == 4){
                guides.push(item.organizator)
              }
              if (item.organizator.role_id == 5){
                agencies.push(item.organizator)
              }
            }
            if (item.shop){
              if (item.shop.role_id == 6){
                shops.push(item.shop)
              }
              if (item.shop.role_id == 7){
                crafts.push(item.shop)
              }
            }
            if (item.souvenir){
              souvenirs.push(item.souvenir)
            }
          })
        }
      }).catch(({response}) => {
        if (response.status === 401){
          window.location.assign('/login')
        }
      });
    }
    catch (e) {
      console.log(e);
    }
    return {places,events,routes,guides,agencies,crafts,shops,souvenirs}
  },
  mounted() {

    // console.log(this.agencies)
  }
}
</script>

<style scoped>

</style>
